Revit 2017 API
PointCloudOverrides.GetPointCloudOverrideSettings Method (ElementId, String, Document)
 Gets override settings assigned to a particular scan within a PointCloudInstance element.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("this method will be obsoleted from 2017, please use GetPointCloudScanOverrideSettings intead.")]
public PointCloudOverrideSettings GetPointCloudOverrideSettings(
	ElementId elementId,
	string scanTag,
	Document doc
)
Visual Basic
<ObsoleteAttribute("this method will be obsoleted from 2017, please use GetPointCloudScanOverrideSettings intead.")> _
Public Function GetPointCloudOverrideSettings ( _
	elementId As ElementId, _
	scanTag As String, _
	doc As Document _
) As PointCloudOverrideSettings
Visual C++
[ObsoleteAttribute(L"this method will be obsoleted from 2017, please use GetPointCloudScanOverrideSettings intead.")]
public:
PointCloudOverrideSettings^ GetPointCloudOverrideSettings(
	ElementId^ elementId,
	String^ scanTag,
	Document^ doc
)
Parameters
elementId
Type: Autodesk.Revit.DB.ElementId
 Id of the overridden element.
scanTag
Type: System.String
 The tag identifying the particular scan within the PointCloudInstance element. Tags can be obtained from PointCloudInstance via method getScans.
doc
Type: Autodesk.Revit.DB.Document
 Document containing the overridden element.
Return Value
 The override settings assigned to the scan, if present, or a default override settings if nothing was found.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when supplied scanTag is not empty while doc is NULL
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
PointCloudOverrides Class
GetPointCloudOverrideSettings Overload
Autodesk.Revit.DB.PointClouds Namespace